Terraform Plan Output:
```
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.data.aws_caller_identity.current: Reading...
module.appcd_b71fd16c-797e-5a95-8e1b-ab22f1e34f43.aws_iam_role.this: Refreshing state... [id=hello-kitty-Raghav-demo]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_kms_key.custom_s3_kms_key[0]: Refreshing state... [id=c7d6e023-221f-48d1-b434-4b3a36f2c98c]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket.this: Refreshing state... [id=raghavdemo]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.data.aws_caller_identity.current: Read complete after 0s [id=222634395437]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_kms_alias.a[0]: Refreshing state... [id=alias/s3-raghavdemo]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_versioning.this[0]: Refreshing state... [id=raghavdemo]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_public_access_block.this: Refreshing state... [id=raghavdemo]
module.appcd_e000ad59-c366-4467-af98-f864dd5f0c32.aws_iam_role_policy.this: Refreshing state... [id=hello-kitty-Raghav-demo:aws_s3-hello-kitty-policy]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_server_side_encryption_configuration.this[0]: Refreshing state... [id=raghavdemo]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.appcd_00a20b0a-2ec0-5bdc-a08d-65a85dc81d5b.aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = [
          + "x86_64",
        ]
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "raghavdemo78676"
      + handler                        = "main.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + s3_bucket                      = "stackgen-builds"
      + s3_key                         = "builds/app.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "appstack"  = "Demokitty"
          + "component" = "hello-kitty"
        }
      + tags_all                       = {
          + "appstack"  = "Demokitty"
          + "component" = "hello-kitty"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "IMAGES_BUCKET" = "raghavdemo78676"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.appcd_00a20b0a-2ec0-5bdc-a08d-65a85dc81d5b.aws_lambda_function_url.this[0] will be created
  + resource "aws_lambda_function_url" "this" {
      + authorization_type = "NONE"
      + function_arn       = (known after apply)
      + function_name      = "raghavdemo78676"
      + function_url       = (known after apply)
      + id                 = (known after apply)
      + invoke_mode        = "BUFFERED"
      + url_id             = (known after apply)
    }

  # module.appcd_3b933db8-c36b-419a-9108-5519ad2b521a.aws_iam_role_policy.this will be created
  + resource "aws_iam_role_policy" "this" {
      + id          = (known after apply)
      + name        = "Writer"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "raghavdemo78676"
    }

  # module.appcd_86ec452a-770a-59bf-87dd-67ed883e25e5.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/raghavdemo78676"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "appstack"  = "Demokitty"
          + "component" = "hello-kitty"
        }
      + tags_all          = {
          + "appstack"  = "Demokitty"
          + "component" = "hello-kitty"
        }
    }

  # module.appcd_b71fd16c-797e-5a95-8e1b-ab22f1e34f43.aws_iam_role.this must be replaced
-/+ resource "aws_iam_role" "this" {
      ~ arn                   = "arn:aws:iam::222634395437:role/hello-kitty-Raghav-demo" -> (known after apply)
      ~ create_date           = "2024-09-28T10:00:39Z" -> (known after apply)
      ~ id                    = "hello-kitty-Raghav-demo" -> (known after apply)
      ~ managed_policy_arns   = [] -> (known after apply)
      ~ name                  = "hello-kitty-Raghav-demo" -> "raghavdemo78676" # forces replacement
      + name_prefix           = (known after apply)
        tags                  = {
            "appstack"  = "Demokitty"
            "component" = "hello-kitty"
        }
      ~ unique_id             = "AROATHVQLI4WXHK5MBIBG" -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ inline_policy (known after apply)
      - inline_policy {
          - name   = "aws_s3-hello-kitty-policy" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "kms:Decrypt",
                              - "kms:Encrypt",
                              - "kms:GenerateDataKey",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:kms:us-west-2:222634395437:key/c7d6e023-221f-48d1-b434-4b3a36f2c98c",
                            ]
                          - Sid      = "AllowKmsAccess"
                        },
                      - {
                          - Action   = [
                              - "s3:PutObject",
                              - "s3:ListBucket",
                              - "s3:GetObject",
                              - "s3:GetObjectVersion",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:s3:::raghavdemo",
                              - "arn:aws:s3:::raghavdemo/*",
                            ]
                          - Sid      = "hellokittyIMAGESBUCKETS3Bucket551e1d2b88ec540687cfc51521bbe894"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # module.appcd_e000ad59-c366-4467-af98-f864dd5f0c32.aws_iam_role_policy.this must be replaced
-/+ resource "aws_iam_role_policy" "this" {
      ~ id          = "hello-kitty-Raghav-demo:aws_s3-hello-kitty-policy" -> (known after apply)
        name        = "aws_s3-hello-kitty-policy"
      + name_prefix = (known after apply)
      ~ role        = "hello-kitty-Raghav-demo" -> "raghavdemo78676" # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 6 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  - aws_cloudwatch_log_group_aws_lambda_hello_kitty_function_name = "/aws/lambda/hello-kitty-function" -> null
  + aws_cloudwatch_log_group_aws_lambda_raghavdemo78676_arn       = (known after apply)
  + aws_cloudwatch_log_group_aws_lambda_raghavdemo78676_name      = "/aws/lambda/raghavdemo78676"
  - aws_iam_role_hello_kitty_raghav_demo_arn                      = "arn:aws:iam::222634395437:role/hello-kitty-Raghav-demo" -> null
  - aws_iam_role_hello_kitty_raghav_demo_name                     = "hello-kitty-Raghav-demo" -> null
  + aws_iam_role_raghavdemo78676_arn                              = (known after apply)
  + aws_iam_role_raghavdemo78676_name                             = "raghavdemo78676"
  - aws_lambda_hello_kitty_raghav_demo_function_name              = "hello-kitty-Raghav-demo" -> null
  + aws_lambda_raghavdemo78676_function_arn                       = (known after apply)
  + aws_lambda_raghavdemo78676_function_name                      = "raghavdemo78676"
  + aws_lambda_raghavdemo78676_function_url                       = (known after apply)
  + aws_lambda_raghavdemo78676_invoke_arn                         = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```